app/views/books/_book.html.erb

SELECT "authors".* FROM "authors" WHERE "authors"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
---
    <strong>Author</strong>
    <%= Author.find(book.author_id).name %>