app/controllers/books_controller.rb

SELECT "authors"."id" FROM "authors" WHERE "authors"."name" = $1  [["name", "name"]]
SELECT 1 AS one FROM "authors" WHERE "authors"."name" = $1 LIMIT $2  [["name", "name"], ["LIMIT", 1]]
INSERT INTO "books" ("title", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["title", ""], ["created_at", "2024-09-06 15:56:18.848138"], ["updated_at", "2024-09-06 15:56:18.848138"]]
INSERT INTO "authors" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "w"], ["created_at", "2024-09-06 20:26:38.871202"], ["updated_at", "2024-09-06 20:26:38.871202"]]
INSERT INTO "authors" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", nil], ["created_at", "2024-09-06 20:24:00.193964"], ["updated_at", "2024-09-06 20:24:00.193964"]]
INSERT INTO "books" ("title", "author_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["title", "w"], ["author_id", 2], ["created_at", "2024-09-06 20:26:38.875251"], ["updated_at", "2024-09-06 20:26:38.875251"]]
INSERT INTO "books" ("title", "author_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["title", "test"], ["author_id", 1], ["created_at", "2024-09-06 20:24:00.201244"], ["updated_at", "2024-09-06 20:24:00.201244"]]
---
  def create
    @id = 0
    if Author.exists?(name: :name)
      @id = Author.where(name: :name).ids
    else
      @author = Author.create(name: book_params[:name])
      @id = @author.id
    end
    @book = Book.create(author_id: @id, title: book_params[:title])


    respond_to do |format|
      if @book.save

UPDATE "books" SET "author_id" = $1, "updated_at" = $2 WHERE "books"."id" = $3  [["author_id", 12], ["updated_at", "2024-09-06 20:13:36.087007"], ["id", 6]]
---
  def update
    respond_to do |format|
      if @book.update(book_params)

DELETE FROM "books" WHERE "books"."id" = $1  [["id", 4]]
---
  def destroy
    @book.destroy!